import React from 'react';
import './Blogs.css';

const Blogs = () => {
    return (
        <div className='container shadow-lg p-3  pb-5 bg-body rounded handlepart mt-5'>
            <h1 className='text-center text-danger '>Que ans for bonus</h1>
            <hr />
            <div className='mt-5 mb-3'>
                <p className='fw-bold'>প্রশ্নঃ কনটেক্সট এপিআই কি?</p>
                <p><span className='fw-bold'>উত্তরঃ</span> কনটেক্সট এপিআই মূলত একটি রিয়েক্ট স্ট্রাকচার যা আমাদেরকে ইউনিক ডিটেইলস আদান প্রদানে সক্ষম করে এবং আমাদের প্রজেক্টের সমস্ত স্তর থেকে প্রপস ডিলিং সমস্যা সমাধানে সহায়তা করে। মূলত এটি রিয়েক্টের জন্য  একটি গ্লোবাল ভেরিয়েবল তৈরি করার একটা উপায় যা চারপাশে পাস করা যাবে। প্রপস ডিলিংয়ের বিকল্প।</p>

            </div>
            <div className='mt-5 mb-3'>
                <p className='fw-bold'>প্রশ্নঃ সিমেন্টিক ট্যাগ কি?</p>
                <p><span className='fw-bold'>উত্তরঃ</span> সিমেন্টিক ট্যাগ  উপস্থাপনার পরিবর্তে ওয়েব পৃষ্ঠার অর্থের পরিচয় দেয়।। যেমনঃ প্যারাগ্রাফ ট্যাগ নির্দেশ করে যে তার মধ্যে থাকা টেক্সটটি একটি প্যারাগ্রাফ। এটি সিমেন্টিক কেননা মানুষ এর মাধ্যমে বুঝতে পারে যে এটা প্যারাগ্রাফ। অপরদিকে অন্যান্য ট্যাগগুলি যেমনঃ বোল্ড , ইটালিক ট্যাগগুলো সিমেন্টিক নয় কেননা তারা শুধু টেক্সটটা কেমন দেখত হবে (বোল্ড, ইতালিক) তা নির্ধারণ করে শুধু। </p>
            </div>
        </div>
    );
};

export default Blogs;